 Projet : Nettoyage et Pr√©traitement des Donn√©es avec Pandas
 Objectifs du projet

Ce projet a pour but de mettre en pratique les √©tapes essentielles du pr√©traitement des donn√©es en utilisant Python, Jupyter Notebook et la biblioth√®que Pandas.

√Ä travers ce projet, l‚Äôobjectif est de :

Charger des jeux de donn√©es √† partir de diff√©rents formats

Explorer et comprendre la structure des donn√©es

Nettoyer les donn√©es (valeurs manquantes, doublons, incoh√©rences)

Pr√©parer les donn√©es pour une future analyse ou un mod√®le de machine learning
 
üìÅ Structure du projet

Le projet est organis√© en trois grandes parties :

Acquisition des donn√©es

Nettoyage et pr√©paration des donn√©es

Application sur le dataset Titanic

In [1]:
#Lecture des donnees avec pandas:Acquisition des donnees
#Lacquisition ds donnees est la premiere etape de tout prjt de data science
#on peut avoir ds donnees qui arrivent de :fichiers locaux,bases de donnes,diffirent format:csv et json
import pandas as pd

df = pd.read_csv("http://mob.u-strasbg.fr/lab/data/titanic.csv")

In [2]:
#Afficher les 10 premi√®res et derni√®res lignes
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [3]:
#Afficher les 10  derni√®res lignes
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
#Obtenir les informations g√©n√©rales du DataFrame
df.shape

(891, 12)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
#Supprimer des colonnes inutiles
df.drop(["SibSp", "Parch", "Ticket", "Cabin", "Embarked"], axis=1, inplace=True)

#df.drop(...) : Supprimer quelque chose du DataFrame
#axis=1 La liste des colonnes √† supprimer
#inplace=True :La suppression est faite directement dans df
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare'], dtype='object')

In [9]:
#D√©finir PassengerId comme index
df.set_index("PassengerId", inplace=True)

In [10]:
#Afficher les valeurs manquantes par colonne
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
Fare          0
dtype: int64

In [12]:
#Remplir les √¢ges manquants par la m√©diane selon la classe
df['Age'] = df.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.median()))

In [13]:
#Cr√©er la colonne Title √† partir de Name
df['Title'] = df['Name'].str.extract('([A-Za-z]+)\.')

In [14]:
#Compter les titres
df['Title'].value_counts()

Title
Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Countess      1
Capt          1
Ms            1
Sir           1
Lady          1
Mme           1
Don           1
Jonkheer      1
Name: count, dtype: int64

In [16]:
#Convertir les titres en chiffres
df['Title'] = df['Title'].map({'Mr':0, 'Miss':1, 'Mrs':2}).fillna(3)
df

,Survived,Pclass,Name,Sex,Age,Fare,Title
PassengerId,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,3.0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,3.0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,3.0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,3.0
5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,3.0
...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,13.0000,3.0
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,30.0000,3.0
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,24.0,23.4500,3.0
890,1,1,"Behr, Mr. Karl Howell",male,26.0,30.0000,3.0
891,0,3,"Dooley, Mr. Patrick",male,32.0,7.7500,3.0

In [18]:
#Convertir la colonne Sex
df['Sex'] = df['Sex'].map({'male':0, 'female':1})
df

,Survived,Pclass,Name,Sex,Age,Fare,Title
PassengerId,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",NaN,22.0,7.2500,3.0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38.0,71.2833,3.0
3,1,3,"Heikkinen, Miss. Laina",NaN,26.0,7.9250,3.0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,35.0,53.1000,3.0
5,0,3,"Allen, Mr. William Henry",NaN,35.0,8.0500,3.0
...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",NaN,27.0,13.0000,3.0
888,1,1,"Graham, Miss. Margaret Edith",NaN,19.0,30.0000,3.0
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,24.0,23.4500,3.0
890,1,1,"Behr, Mr. Karl Howell",NaN,26.0,30.0000,3.0
891,0,3,"Dooley, Mr. Patrick",NaN,32.0,7.7500,3.0

In [19]:
df['Sex'].unique()

array([nan])

In [21]:
df = pd.read_csv("http://mob.u-strasbg.fr/lab/data/titanic.csv")

In [22]:
df = df.drop(["SibSp", "Parch", "Ticket", "Cabin", "Embarked"], axis=1)

In [23]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [24]:
df['Sex'].unique()

array([0, 1])

In [25]:
df[['Sex']].head()

   Sex
0    0
1    1
2    1
3    1
4    0

In [27]:
#Transformer la colonne Fare avec loc
df.loc[df['Fare'] <= 17, 'Fare'] = 0
df.loc[(df['Fare'] > 17) & (df['Fare'] <= 30), 'Fare'] = 1
df.loc[(df['Fare'] > 30) & (df['Fare'] <= 100), 'Fare'] = 2
df.loc[df['Fare'] > 100, 'Fare'] = 3